Revit 2027 API
DisplacementPath.PathStyle Property
 Specifies the style of the path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DisplacementPathStyle PathStyle { get; set; }
Public Property PathStyle As DisplacementPathStyle
	Get
	Set
public:
property DisplacementPathStyle PathStyle {
	DisplacementPathStyle get ();
	void set (DisplacementPathStyle value);
}
member PathStyle : DisplacementPathStyle with get, set
Property Value
DisplacementPathStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DisplacementPath Class
Autodesk.Revit.DB Namespace